# TODO: Пожалуйста, добавьте свой код ниже с комментариями и понятными названиями переменных.
rows: int = int(input('Введите целое положительное число:'))

for i in range(rows):
    for j in range(i + 1):
        print(i + 1, end=' ')
    print()

count_rows: int = 1 #счетчик строк. начинаем со строки со значением 1, как требуется в условии
while count_rows <= rows: #цикл будет выполняться пока счетчик строк <= введеного значения
    count_element: int = 1 #счетчик элементов в строке. по условию задачи треугольник должен начинаться с 1
    while count_element <= count_rows: #цикл будет выполняться пока счетчик элементов <= счетчика строк
        print(count_rows, end=' ') #если предыдущая срока истина, выводится значение счетчика строк, в конце цикла пробел - команда end
        count_element += 1 #по завершению внутреннего цикла прибавляем 1 к счетчику элементов
    print() #пустой print для перехода на новую строку
    count_rows += 1 #после перехода на новую строку в следующей итерации к счетчику строк прибавляется 1
