# TODO: Пожалуйста, добавьте свой код ниже с комментариями и понятными названиями переменных.
start: int = int(input())
finish: int = int(input())

if start == finish or (start < 0 or finish < 0): #проверяю введенные числа на корректность ввода
    print('Некорректный диапазон')

else:
    if start > finish:
        start, finish = finish, start #если первое значение диапазона больше конечного, то меняю их местами

    for num in range(start, finish + 1): #добавляю к конечному значению +1, чтобы в диапазон вошли все числа включительно
        num_str = str(num)
        power = len(num_str) #нахожу степень, в которую нужно будет возводить число

        sum_armstr: int = 0 #переменная для хранения суммы
        num_copy = num #копия числа, чтобы не стереть основное проверяемое число
        while num_copy != 0:
            last_digit = num_copy % 10
            sum_armstr += last_digit ** power #в сумму складываю отрезанную последнюю цифру, возведенную в степень. степень будет равна количеству цифр в числе
            num_copy = num_copy // 10 #отбрасываю последнюю цифру, чтобы в следующем цикле работать с новой последней цифрой числа
        if sum_armstr == num: #если получившаяся сумма равна исходному числу, то значит, что это и есть число Армстронга
            print(num, end=' ') #печатаю вывод - все числа через пробел в одну строку
